{ "roasts": {
  "//provided by" : "These roasts are provided by: https://kopywritingkourse.com/roast-generator/",
  "array":
    [ "We are doing this roast tonight to help ${roastedName} live out one of they sexual fantasies, to have a room full of they friends shit all over him.",
  "A little known fact is that a long time ago ${roastedName} used to work at McDonald’s. It was the last time anyone said about your work, “I’m lovin’ it.”",
  "This is exciting ${roastedName} right?? Well tell your face.",
  "${roastedName} if laughter is the best medicine, your face must be curing the world.",
  "It’s nice to see such a diverse crowd here today. We’ve got Indians, Jews, Whites, and whatever the fuck ${roastedName} is. ",
  "Welcome to the roast of ${roastedName}! My only regret is that ${roastedName}’s roast is happening in 2019 in Austin, and not 1945 Germany.",
  "${roastedName}’s so old and Jewish they attended Shakespeare’s bar mitzvah.",
  "${roastedName}’s so Jewish they tagline on LinkedIn is: “Once you go Jew, no Christian will do.”",
  "${roastedName}’s so Jewish and so gay at the synagogue they call him a HeBlew.",
  "${roastedName} went to Israel for a month to explore they Jewish heritage. they found out a bunch of new things about they culture. For example, did you know they Hebrew name is “Yeecchh.”",
  "${roastedName}, I heard in Israel everyone spends Saturday at home with their families? That’s sweet. But man, your mom nags a lot and can be really challenging and annoying. I feel for you. If I had a mother like that I’d be gay too.",
  "This is a very Jewish neighborhood you live in ${roastedName}. Even the ATM down the street is Jewish.",
  "When I tried to take out some money, it said, “What did you do with the last $50 I gave you??”",
  "Of course ${roastedName} is the center of attention tonight. Dude you’re like a Jewish rockstar! What’s your band name: Guns & Noses?",
  "${roastedName} is a very religious person. they actually models they life after Jesus. And by that I mean they’s a Jew who’s only been nailed three times.",
  "But everyone knows our dear friend ${roastedName}, they‘s like a Jewish rockstar. What band are in, “I Want My Nickelback?”",
  "Listening to ${roastedName}’s speech tonight answers the question: “What if Hitler only killed all the funny Jews?”",
  "By the way where’s my other Jews at?? Oh nice, we’re just two more away from a condo board meeting!",
  "But geez ${roastedName} you’re getting fatter by the day. You’re like Honey Jew Jew. ",
  "${roastedName}’s so old they owes Jesus a nickel.",
  "${roastedName}’s so old one of they favorite memories as a child was taking a boat ride with two of every animal.",
  "${roastedName}’s so old they prostate is almost the size of they ego.",
  "${roastedName}’s so old they blood type is Oh-No.",
  "You’re such an old fossil already…..${roastedName} is so old, that when they was a kid science fiction was a horseless carriage.",
  "${roastedName}’s definitely showing they age. Backstage I gave him a joint to alleviate they chronic pain, and they rubbed BenGay in it.",
  "${roastedName} recently quit they job and now has a lot of free time. they plans on spending they retirement opening a jar.",
  "${roastedName}’s so old the first porno they watched was a ghost banging some chick named Mary.",
  "${roastedName}’s so old they balls are starting to look like a tent nobody knows how to fold up.",
  "${roastedName} is getting so old they has to take an Aspirin before they jerks off. ",
  "You all know ${roastedName} is my first and most longtime friend I have. What you may not know is that they’s also the first and most longtime customer of ProActive Acne Systems.",
  "Good lord this is an ugly group of people. Holy shit, you know the crowd is ugly when we invited ${roastedName} as eye candy.",
  "And ${roastedName} you’re looking pretty rough this evening. ${roastedName} looks like if sweatpants were a person.",
  "Getting married to you must’ve been rough. What was your wedding song? “How Much Is That Doggy In The Window?”",
  "${roastedName} is so ugly they’s been the only one ever rejected from Queer Eye for the Straight guy.",
  "${roastedName} is so ugly in October when they went to the haunted house they handed they an application.",
  "${roastedName}’s psychiatrist said they was crazy and they said they wanted a second opinion. The psychiatrist said “Okay, you’re ugly too.”",
  "${roastedName}’s nose is so big they Apple had to make a custom iPhone that unlocks using Nose ID. ",
  "Holy shit don’t look now but ${roastedName}’s gotten hairy-er since we started this roast!",
  "${roastedName} lost 30 lbs when they joined Weight Watchers, and lost another 10 lbs when we shaved they back.",
  "${roastedName} you’re so hairy you’re making it hard for your parents to choose a wife for you. You look like slumdog million hair. ",
  "We all love ${roastedName} but they definitely is one cheap bastard. For example, they loves watching porno in reverse. I asked him why they did that, and they said, “I like the part where the hooker gives the money back.”",
  "Me and ${roastedName} we’re talking. I told they you’re supposed to spend 2 months salary on an engagement ring. ${roastedName} was like, “Dude I’m not gonna spend 2 or 3 hundreds dollars on no engagement ring!”",
  "${roastedName} I’m glad you could come today, but will be sad you’re leaving early for your side gig driving for Uber.",
  "${roastedName}’s so cheap they won’t even pay attention.",
  "${roastedName}’s so cheap they complains that penny slots are expensive.",
  "${roastedName}’s so cheap they won’t even tip his hat.",
  "${roastedName} is SO stingy the ducks throw bread at him. ",
  "I’d like to thank all of you for coming today, and I’d like to thank ${roastedName} for polishing they head.",
  "I thought we were gathered here today for the Roast of ${roastedName}. But as I look around at all these attendees, this looks more like a support group for balding men.",
  "But in all seriousness, ${roastedName} is a great person. they heart is almost big as they bald spot.",
  "On a more serious note….${roastedName}, despite all your accomplishments, despite all the businesses you’ve created, despite all the incomes you’ve increased, despite all the people you’ve helped, and despite all the lives you’ve touched…….you’re still going fucking bald.",
  "${roastedName} is very hardworking. The only thing not hard working on ${roastedName} is they hair follicles.",
  "Hey ${roastedName} I like your haircut. You look like the world’s tallest baby.",
  "${roastedName} I think it’s really cool you go to the same barber as Jeff Bezos.",
  "${roastedName} looks like the “Before” picture on those Hair Club for Men commercials. ",
  "${roastedName} when are you gonna buy a new outfit??",
  "Everyday you wear the same jeans and same flannel patterned shirt.",
  "You’re like if Al Borland from Home Improvement learned to program a computer.",
  "The way ${roastedName} dresses looks like the first half of a commercial for antidepressants.",
  "${roastedName} is actually pretty good looking, but has a boring personality. Good looks but boring personality, you’re like real life clickbait.",
  "${roastedName} has worn the same outfit for like 10 years. Holy shit….the only person who’s worn the same clothes longer than you is Bart Simpson.",
  "${roastedName} I’m glad you and your dull personality could be here. I’m excited to hear your speech at the wedding. With your personality, I’m sure your speech will combine the thrill of talking, with the excitement of standing there.",
  "${roastedName}’s outfit was recently featured on the cover of Yawn Magazine. ",
  "Holy crap there’s a lot of Asian’s here tonight. Our friend group looks like the first set of workers on the Transcontinental Railroad.",
  "${roastedName} does the worlds hardest job, they’s a police sketch artist in China.",
  "${roastedName} so Asian they was adopted by Brad and Angelina.",
  "Hey ${roastedName}, did you hear about that Asian guy that won a beauty contest. Yea, me neither.",
  "Hey ${roastedName}, why do Asian girls always have small boobs? “Because only A’s are acceptable!”",
  "But don’t worry about ${roastedName} getting too upset about these Asian jokes, they’ll have time to calm down. If they starts crying and leaves the party, it’ll take him at least 3 hours to back out of the driveway.",
  "But it’s ok even if you do have an unplanned baby. In the Asian culture you’re allowed to abort the fetus until it graduates from medical school.",
  "${roastedName} looks like they was adopted by Brad and Angelina.",
  "${roastedName} I dunno where you’re from, but I’m assuming your parents met on a raft.",
  "::Points at ${roastedName}:: It’s nice to see the president of the [CITY] Mahjong Committee here this evening. ",
  "${roastedName} is so white MY credit score just went up 80 points.",
  "${roastedName} is really an American Dream come true. I’m so happy to finally see a middle aged white person get an opportunity.",
  "And let’s welcome ${roastedName} today, or as the Germans call they: Hitler’s Wet Dream.",
  "I was impressed when ${roastedName} played that guard in Schindler’s List.",
  "Hey ${roastedName} I’m looking around and there is not a lot of diversity here. We’re just one more white guy away from a Klan meeting. ",
  "But ${roastedName} you’re really looking good nowadays. What ${roastedName} has lost in weight, they has also GAINED in weight.",
  "But ${roastedName} you’ve definitely been packing on the pounds. The last time ${roastedName} went to the dry cleaners they said, “We don’t do curtains.”",
  "${roastedName} I checked your Facebook, and it turns out you used to be a bit chubby. I’m impressed that you’ve managed to lose so much weight. That’s right, ${roastedName} lost 30 pounds on Nutrisystem, and another 10 when they shaved they back.",
  "Backstage before this speech I rolled a gigantic fatty. Because that was the only way we could get ${roastedName} on to the stage.",
  "${roastedName} so fat and lazy the only exercise they gets is when they Restless Leg Syndrome starts flaring up.",
  "Your family told me they regret they couldn’t’ be here tonight, but they did send 4 bags of grain.",
  "${roastedName} you look like if the fat kid from Stranger Things wished he was big. ",
  "The church didn’t accept ${roastedName}’s gay lifestyle. So they started they own religion: The Church of Latter Day Taints. It’s like a normal church, except you’re happy when the priest fucks you.",
  "Me and ${roastedName} are really good friends but we’ve had our ups and downs, one time ${roastedName} actually tried to sue me for $10,000. I got really defensive and was like “You’re suing me for $10,000?? Fuck you…you can suck my dick.” and ${roastedName} was like, “well OK if you want to settle out of court.”",
  "Me and ${roastedName} are good friends and we hangout a lot. And some people have even suspected we were gay or something. But that’s not true. We like hanging out and discussing manly guy stuff. Like one time I asked him, “${roastedName}, tell me about your first blowjob, what was it like?” And they said “oh man, it tasted awful.”",
  "When I heard that ${roastedName} finally came out of the closet I wasn’t really surprised….dude you’re so gay MY ass hurts.",
  "I once asked ${roastedName} why they dresses so flamboyantly and they got upset and hit me with they purse.",
  "I’m having a pretty good time at this roast, but I’m really disappointed with this venue…..I was hoping we could have dinner at a location with a lot more space….like ${roastedName}’s asshole.",
  "${roastedName} – I’m glad you got taken off of the party planning committee, if it were up to you, we’d all be watching showtunes, male strippers, or those two fruitcakes with the white tiger.",
  "Actually the last time me and ${roastedName} hung out it ended kind of weird. We were gonna smoke weed together. I asked if they had papers, and they just ran off. ",
  "Hey ${roastedName}, why was Hellen Keller such a bad driver? Because she’s a woman.",
  "Hey ${roastedName}, why do Japanese people have such squinty eyes? Because atomic bombs are hella bright.",
  "This group is literally Hitler’s wet dream. It’s got Jews, Indians, Russians, and whatever the fuck ${roastedName} is.”",
  "I wanna everyone for coming to this roast. My one complaint is next time that we have dinner in some place much larger, like ${roastedName}’s pussy.  " ]
}}